Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxFce_regdef.h
/** \\brief  CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN0_CRC_Bits B;
} Ifx_FCE_IN0_CRC;

/** \\brief  Input Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_FCE_IN0_IR_Bits B;
} Ifx_FCE_IN0_IR;

/** \\brief  CRC Result Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN0_RES_Bits B;
} Ifx_FCE_IN0_RES;

/** \\brief  CRC Check Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_FCE_IN1_CHECK_Bits B;
} Ifx_FCE_IN1_CHECK;

/** \\brief  CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN1_CRC_Bits B;
} Ifx_FCE_IN1_CRC;

/** \\brief  Input Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_FCE_IN1_IR_Bits B;
} Ifx_FCE_IN1_IR;

/** \\brief  CRC Result Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN1_RES_Bits B;
} Ifx_FCE_IN1_RES;

/** \\brief  CRC Check Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_FCE_IN2_CHECK_Bits B;
} Ifx_FCE_IN2_CHECK;

/** \\brief  CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN2_CRC_Bits B;
} Ifx_FCE_IN2_CRC;

/** \\brief  Input Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_FCE_IN2_IR_Bits B;
} Ifx_FCE_IN2_IR;

/** \\brief  CRC Result Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN2_RES_Bits B;
} Ifx_FCE_IN2_RES;

/** \\brief  CRC Check Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int           U;
    /** \brief Signed access */
    signed int             I;
    /** \brief Bitfield access */
    Ifx_FCE_IN3_CHECK_Bits B;
} Ifx_FCE_IN3_CHECK;

/** \\brief  CRC Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN3_CRC_Bits B;
} Ifx_FCE_IN3_CRC;

/** \\brief  Input Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_FCE_IN3_IR_Bits B;
} Ifx_FCE_IN3_IR;

/** \\brief  CRC Result Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_IN3_RES_Bits B;
} Ifx_FCE_IN3_RES;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int       U;
    /** \brief Signed access */
    signed int         I;
    /** \brief Bitfield access */
    Ifx_FCE_KRST0_Bits B;
} Ifx_FCE_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int       U;
    /** \brief Signed access */
    signed int         I;
    /** \brief Bitfield access */
    Ifx_FCE_KRST1_Bits B;
} Ifx_FCE_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int         U;
    /** \brief Signed access */
    signed int           I;
    /** \brief Bitfield access */
    Ifx_FCE_KRSTCLR_Bits B;
} Ifx_FCE_KRSTCLR;

/** \\brief  CRC Length Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int        U;
    /** \brief Signed access */
    signed int          I;
    /** \brief Bitfield access */
    Ifx_FCE_LENGTH_Bits B;
} Ifx_FCE_LENGTH;

/** \\brief  CRC Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int     U;
    /** \brief Signed access */
    signed int       I;
    /** \brief Bitfield access */
    Ifx_FCE_STS_Bits B;
} Ifx_FCE_STS;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Fce_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Input */
typedef volatile struct _Ifx_FCE_IN0
{
    Ifx_FCE_IN0_IR    IR;                   /**< \brief 0, Input Register */
    Ifx_FCE_IN0_RES   RES;                  /**< \brief 4, CRC Result Register */
    Ifx_FCE_CFG       CFG;                  /**< \brief 8, CRC Configuration Register */
    Ifx_FCE_STS       STS;                  /**< \brief C, CRC Status Register */
    Ifx_FCE_LENGTH    LENGTH;               /**< \brief 10, CRC Length Register */
    Ifx_FCE_IN0_CHECK CHECK;                /**< \brief 14, CRC Check Register */
    Ifx_FCE_IN0_CRC   CRC;                  /**< \brief 18, CRC Register */
    Ifx_FCE_CTR       CTR;                  /**< \brief 1C, CRC Test Register */
} Ifx_FCE_IN0;

/** \\brief  Input */
typedef volatile struct _Ifx_FCE_IN1
{
    Ifx_FCE_IN1_IR    IR;                   /**< \brief 0, Input Register */
    Ifx_FCE_IN1_RES   RES;                  /**< \brief 4, CRC Result Register */
    Ifx_FCE_CFG       CFG;                  /**< \brief 8, CRC Configuration Register */
    Ifx_FCE_STS       STS;                  /**< \brief C, CRC Status Register */
    Ifx_FCE_LENGTH    LENGTH;               /**< \brief 10, CRC Length Register */
    Ifx_FCE_IN1_CHECK CHECK;                /**< \brief 14, CRC Check Register */
    Ifx_FCE_IN1_CRC   CRC;                  /**< \brief 18, CRC Register */
    Ifx_FCE_CTR       CTR;                  /**< \brief 1C, CRC Test Register */
} Ifx_FCE_IN1;

/** \\brief  Input */
typedef volatile struct _Ifx_FCE_IN2
{
    Ifx_FCE_IN2_IR    IR;                   /**< \brief 0, Input Register */
    Ifx_FCE_IN2_RES   RES;                  /**< \brief 4, CRC Result Register */
    Ifx_FCE_CFG       CFG;                  /**< \brief 8, CRC Configuration Register */
    Ifx_FCE_STS       STS;                  /**< \brief C, CRC Status Register */
    Ifx_FCE_LENGTH    LENGTH;               /**< \brief 10, CRC Length Register */
    Ifx_FCE_IN2_CHECK CHECK;                /**< \brief 14, CRC Check Register */
    Ifx_FCE_IN2_CRC   CRC;                  /**< \brief 18, CRC Register */
    Ifx_FCE_CTR       CTR;                  /**< \brief 1C, CRC Test Register */
} Ifx_FCE_IN2;

/** \\brief  Input */
typedef volatile struct _Ifx_FCE_IN3
{
    Ifx_FCE_IN3_IR    IR;                   /**< \brief 0, Input Register */
    Ifx_FCE_IN3_RES   RES;                  /**< \brief 4, CRC Result Register */
    Ifx_FCE_CFG       CFG;                  /**< \brief 8, CRC Configuration Register */
    Ifx_FCE_STS       STS;                  /**< \brief C, CRC Status Register */
    Ifx_FCE_LENGTH    LENGTH;               /**< \brief 10, CRC Length Register */
    Ifx_FCE_IN3_CHECK CHECK;                /**< \brief 14, CRC Check Register */
    Ifx_FCE_IN3_CRC   CRC;                  /**< \brief 18, CRC Register */
    Ifx_FCE_CTR       CTR;                  /**< \brief 1C, CRC Test Register */
} Ifx_FCE_IN3;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Fce_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  FCE object */
typedef volatile struct _Ifx_FCE
{
    Ifx_FCE_CLC     CLC;                    /**< \brief 0, Clock Control Register */
    unsigned char   reserved_4[4];          /**< \brief 4, \internal Reserved */
    Ifx_FCE_ID      ID;                     /**< \brief 8, Module Identification Register */
    unsigned char   reserved_C[20];         /**< \brief C, \internal Reserved */
    Ifx_FCE_IN0     IN0;                    /**< \brief 20, Input */
    Ifx_FCE_IN1     IN1;                    /**< \brief 40, Input */
    Ifx_FCE_IN2     IN2;                    /**< \brief 60, Input */
    Ifx_FCE_IN3     IN3;                    /**< \brief 80, Input */
    unsigned char   reserved_A0[76];        /**< \brief A0, \internal Reserved */
    Ifx_FCE_KRSTCLR KRSTCLR;                /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_FCE_KRST1   KRST1;                  /**< \brief F0, Kernel Reset Register 1 */
    Ifx_FCE_KRST0   KRST0;                  /**< \brief F4, Kernel Reset Register 0 */
    Ifx_FCE_ACCEN1  ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_FCE_ACCEN0  ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
    unsigned char   reserved_100[256];      /**< \brief 100, \internal Reserved */
} Ifx_FCE;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXFCE_REGDEF_H */
